SunCity/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SunCity/src/CommonModules/МаркетинговыеАкцииРМКВызовСервера/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// МаркетинговыеАкцииРМКВызовСервера содержит процедуры и функции 
// для работы с маркетинговыми акциями.
//  
////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

// Выполняет аутентификацию пользователя по владельцу информационной карты.
// 
// Параметры:
//  ВладелецКарты - СправочникСсылка.Пользователи,
//                  СправочникСсылка.ФизическиеЛица - владелец карты маркетинговой акции.
//  ТекущийМагазин - СправочникСсылка.Магазины - 
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи,
//  СправочникСсылка.ФизическиеЛица - пользователь карты.
//
Функция АвторизацияПользователяПоВладельцуКарты(ВладелецКарты, ТекущийМагазин) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ВладелецКарты) = Тип("СправочникСсылка.Пользователи") Тогда
		
		Если ЗначениеЗаполнено(ВладелецКарты.ИдентификаторПользователяИБ)  Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ВладелецКарты.ИдентификаторПользователяИБ);
		Иначе
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ВладелецКарты.Наименование);
		КонецЕсли;
		
		Если ПользовательИБ = Неопределено Тогда
		
			Возврат Неопределено;
		
		КонецЕсли;
		
		ПользовательКарты = ВладелецКарты;
		
	ИначеЕсли ТипЗнч(ВладелецКарты) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		ПользовательКарты = ОпределитьПользователяПоФизическомуЛицу(ВладелецКарты, ТекущийМагазин);
		Если Не ЗначениеЗаполнено(ПользовательКарты) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ПользовательКарты;

КонецФункции

// Возвращает случайное число для проверки.
//
// Возвращаемое значение:
//  Строка - число в формате от 0 до 9999.
//
Функция КодПроверкиДисконтнойКарты() Экспорт
	
	ТекущаяДата = ТекущаяДатаСеанса();
	НачальноеЧисло = Год(ТекущаяДата) + Месяц(ТекущаяДата) + День(ТекущаяДата) + Час(ТекущаяДата) +
	Минута(ТекущаяДата) + Секунда(ТекущаяДата);
	Генератор = Новый ГенераторСлучайныхЧисел(НачальноеЧисло);
	КодПроверки = Генератор.СлучайноеЧисло(0, 9999);
	Если КодПроверки < 1000 Тогда
		КодПроверкиСтрокой = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Строка(КодПроверки), 4, "0");
	Иначе
		КодПроверкиСтрокой = Формат(КодПроверки, "ЧГ=0");
	КонецЕсли;
	
	Возврат КодПроверкиСтрокой;
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает список пользователей, связанных
// с пользователями текущей информационной базы.
//
Функция СписокПользователейИнформационнойБазы()
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивПользователейИБ = Новый Массив;
	МассивПользователейБазы = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
	Для Каждого ПользовательИБ Из МассивПользователейБазы Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ 
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Наименование = &ИдентификаторНаименованияПользователяИБ
		|	ИЛИ Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ";
		
		Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", ПользовательИБ.УникальныйИдентификатор);
		Запрос.УстановитьПараметр("ИдентификаторНаименованияПользователяИБ", ПользовательИБ.Имя);
		
		Результат = Запрос.Выполнить();
		ТаблицаЗапроса = Результат.Выгрузить();
		
		Для каждого СтрокаЗапроса  Из ТаблицаЗапроса Цикл
			МассивПользователейИБ.Добавить(СтрокаЗапроса.Ссылка);
		КонецЦикла; 
		
	КонецЦикла;
	
	Возврат МассивПользователейИБ;
	
КонецФункции

// Определяет пользователя по переданному
// физическому лицу.
//
Функция ОпределитьПользователяПоФизическомуЛицу(ФизЛицо, ТекущийМагазин)
	
	Результат = Справочники.Пользователи.ПустаяСсылка();
	
	МассивПользователейИБ = СписокПользователейИнформационнойБазы();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ФизическоеЛицо = &ФизЛицо
	|	И Пользователи.ФизическоеЛицо.ПометкаУдаления = ЛОЖЬ
	|	И Пользователи.Ссылка В(&МассивПользователейИБ)";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("МассивПользователейИБ", МассивПользователейИБ);
	Запрос.УстановитьПараметр("Магазин", ?(ЗначениеЗаполнено(ТекущийМагазин), ТекущийМагазин, ПараметрыСеанса.ТекущийМагазин));
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() >= 1 Тогда
		
		Результат = Выборка[0].Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
